---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.#ctor
source: html/1526b1df-8abf-df78-55a7-241b95043513.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.#ctor Method

The default constructor.

## Syntax (C#)
```csharp
public IFCExtrusionCreationData()
```

## Remarks
All input data will be considered uninitialized.